<script setup lang="ts">

import { transportationItems } from '~/constants/transportationAdvantages'

useSeoMeta({
  title: 'Международные перевозки — Автоцентр на Лазурной',
  description: 'Осуществляем международные грузоперевозки по странам СНГ и Азии, обеспечивая надёжную и своевременную доставку грузов любой сложности с полным логистическим сопровождением.',
})

</script>

<template>
    <BasePageDescriptionSection
        header-title="Международные перевозки"
        header-description="Осуществляем международные грузоперевозки по странам СНГ и Азии, обеспечивая надёжную и своевременную доставку грузов любой сложности с полным логистическим сопровождением."
        title="Надёжная логистика без границ"
        description="Разрабатываем оптимальные маршруты, контролируем каждый этап перевозки и гарантируем сохранность груза и соблюдение сроков. Берём на себя организационные вопросы и обеспечиваем прозрачность сотрудничества на всём пути следования."
        description-badge="Наши преимущества:"
        image="reviews"
        :items="transportationItems"
    />
    <FormsTransportationSection />
</template>