import type { ICard } from '~/components/CardSection.vue'

export const advantages: ICard[] = [
  {
    cardTitle: 'Опыт',
    cardDescription: 'Наша команда состоит из квалифицированных специалистов с большим практическим опытом. Мы работаем в соответствии с действующими нормами Республики Беларусь и используем современное оборудование.',
    cardIcon: 'heroicons:trophy-20-solid',
  },
  {
    cardTitle: 'Забота о клиентах',
    cardDescription: 'Мы ценим время и задачи каждого клиента. Предлагаем удобный формат обслуживания, гибкий подход и оперативное выполнение работ.',
    cardIcon: 'heroicons:user-group-20-solid',
  },
  {
    cardTitle: 'Техническая база',
    cardDescription: 'Автоцентр оснащен профессиональным оборудованием, что позволяет обеспечивать стабильный результат, безопасность и соответствие всем установленным требованиям.',
    cardIcon: 'heroicons:cpu-chip-20-solid',
  },
  {
    cardTitle: 'Комплексный подход',
    cardDescription: 'Мы объединяем несколько ключевых направлений в одном месте, что экономит ваше время и позволяет решать задачи комплексно — быстро, удобно и надежно.',
    cardIcon: 'heroicons:rectangle-group-20-solid',
  },
]