import type { ICardDescription } from '~/constants/pageDescriptionCard'

export const inspectionItems: ICardDescription[] = [
    {
        icon: { type: 'text', value: '01'},
        title: 'Предварительная запись',
        descriptionPart: [
            { type: 'text', value: 'Запишитесь на удобное для вас время через ' },
            { type: 'link', value: 'сайт', to: '#form' },
            { type: 'text', value: ' или ' },
            { type: 'link', value: 'по телефону', to: 'tel:+375447154444', external: true },
            { type: 'text', value: '. Предварительная запись позволяет избежать ожидания и пройти техосмотр быстро и комфортно. Наши специалисты при необходимости проконсультируют по перечню документов и требованиям.' },
        ],
    },
    {
        icon: { type: 'text', value: '02'},
        title: 'Самостоятельная проверка',
        descriptionPart: [{ type: 'text', value: 'Рекомендуется заранее убедиться в исправности основных систем транспортного средства, а также произвести мойку автомобиля. Это поможет сократить время диагностики и повысить вероятность успешного прохождения с первого раза.' }],
    },
    {
        icon: { type: 'text', value: '03'},
        title: 'Предоставление документов',
        descriptionPart: [{ type: 'text', value: 'По прибытии на станцию гостехосмотра необходимо предоставить водительское удостоверение и свидетельство о регистрации транспортного средства в окно приёма для внесения данных о транспортном средстве и владельце (или представителе владельца) в базу данных и систему контроля.' }],
    },
    {
        icon: { type: 'text', value: '04'},
        title: 'Оплата услуг',
        descriptionPart: [
            { type: 'text', value: 'Перед началом инструментальной диагностики необходимо произвести оплату услуг диагностической станции и государственную пошлину за выдачу разрешения на допуск транспортного средства к участию в дорожном движении. Оплата может быть выполнена непосредственно на станции либо ' },
            { type: 'link', value: 'заранее через систему ЕРИП', to: '#', external: true },
            { type: 'text', value: ' (обязательно укажите ФИО).' },
        ],
    },
    {
        icon: { type: 'text', value: '05'},
        title: 'Контрольно-диагностические работы',
        descriptionPart: [{ type: 'text', value: 'На данном этапе специалисты проводят комплексную проверку технического состояния транспортного средства с использованием сертифицированного диагностического оборудования. Проверке подлежат тормозная система, рулевое управление, подвеска, световые приборы, уровень токсичности выхлопных газов и иные параметры, установленные действующими нормативными актами Республики Беларусь.' }],
    },
    {
        icon: { type: 'text', value: '06'},
        title: 'Получение результатов',
        descriptionPart: [{ type: 'text', value: 'По завершении проверки формируется официальное заключение о соответствии либо несоответствии транспортного средства установленным требованиям безопасности. В случае выявления недостатков владельцу предоставляется перечень замечаний и разъясняется порядок их устранения и повторного прохождения осмотра.' }],
    },
    {
        icon: { type: 'text', value: '07'},
        title: 'Оформление документов',
        descriptionPart: [{ type: 'text', value: 'По результатам проведённой проверки оформляется диагностическая карта, в которой отражаются все параметры и показатели состояния автомобиля. Если транспортное средство признано технически исправным, оформляется электронная диагностическая карта, а по желанию клиента может быть выдан её бумажный экземпляр.' }],
    },
    {
        icon: { type: 'text', value: '08'},
        title: 'В РАЗРАБОТКЕ',
        descriptionPart: [{ type: 'text', value: 'Данный пункт находится на стадии разработки содержания' }],
    },
]